# 리눅스 기본 명령어 정리

shutdown 명령

- shutdown -P : 전원끄기
- shutdown -r : 재부팅
- shutdown -c : 취소
- shutdown -k : 메세지 전송(실제종료x)
- shutdown -h :
- shutdown -s-t 60 : 1분후 꺼짐
- shutdown -s-t 600 : 10분후 꺼짐

### 콘솔이동

- CTRL+ALT+F1~F6

[런레벨]

- /lib/systemd/system 디렉터리의 runlevel?.target 파일 확인해 런레벨 모드 확인

### 자동완성과 히스토리

- 자동완성과 도스키 기능
    - 터미널에서 방향키 위아래 누르면 이전에 실행했던 명령 나옴
    - history : 기존에 사용했던 명령 보기
    - hitory -c : 저장되었던 명령 모두 삭제
    - tab : 자동완성키
    

### 리눅스에서 자주 사용되는 에디터

- gedit
    - 한영전환 : shift+space
- vi
    - :q - 종료
        - 이렇게 작동하는 것을 ex 모드, 라인명령모드라고 부름
    - I, A : insert 모드
    - ESC : escape
    - 저장(w), 종료(q), 취소(i)
    - !(무시하고 종료)
    - U : undo 기능(돌아가기)
    - .swp : 비정상종료된 파일명
    
    [입력키]
    
    [이동키]
    
    [삭제,복사,붙여넣기]
    
    [문자열찾기]

### 도움말

- man 명령어
    - man [섹션번호] 명령어
        - 섹션 1 : 명령어
        - 섹션 2~3 : 프로그래밍
        - 섹션 4 : 디바이스
        - 섹션 5 : 파일형식
        - 섹션 6 : 게임
        - 섹션 7 : 기타
        - 섹션 8 : 시스템관리
        - 섹션 9 : 커널관련 설명
        

### 마운트

- CD/DVD 마운트
    - mount : 현재 마운트된 장치 확인
    - umount /dev/cdrom : 마운트 해제
    - /dev/sr0 = /dev/cdrom
    - 자동 마운트 cd/dvd 디렉터리 : /run/media
    - target is busy(마운트해제 실패) : 하위디렉터리에 있는 경우
        - cd 명령어 입력해 마운트 디렉터리 아닌 디렉터리로 이동해
        - umount /dev/cdrom 명령으로 마운트해제
- USB
    - Cent OS 기본적으로 FAT32 방식 USB만 인식가능
    - cd /run/media/현재사용자이름/USB이름 으로 이동
    - mount : /dev/sda1이라는 장치로 인식되어 있음 확인 가능
    - ls /dev/sd* : sd로 시작하는 장치이름 확인 가능
    - mkdir /media/cdrom : cd/dvd 마운트하는 디렉터리 생성
    - mkdir /media/usb
    - mount /dev/cdrom /media/cdrom
    - mount /dev/sda1 /media/usb
    

### 리눅스 기본 명령어

- ls
    - list 약자, windows 'dir'과 같은 역할
    - 해당 디렉터리에 있는 파일의 목록 나열
    - ls -a
        - 현재 디렉터리의 목록(숨김파일 포함, .txt 파일 보려면)
    - ls -l
        - 현재 디렉터리의 목록
    - ls *.cfg
        - 확장자명 cfg인 목록
    - ls -l /etc/sysconfig/a*
        - ~디렉터리에 있는 목록중 앞글자 a인 것
    - ls -ald D*
        - D로 시작하는 모든 파일 들어가지 않고 목록만 보여줌
    - ls D?
        - D로 시작하고 문자 하나만 붙어있는 것
    - ls . : 현재 디렉터리
    - ls .. : 부모 디렉터리
    - ls ../.. : 루트 디렉터리
- cd
    - change directory, 디렉터리를 이동
    - ~ : 홈디렉터리
    - .. : 부모디렉터리
    - cd ../etc/sysconfig : 현재디렉토리의 상위 디렉토리로 이동한 후 /etc/sysconfig로 이동
- pwd
    - 현재 디렉터리의 전체 경로 출력
- rm
    - 파일, 디렉터리 삭제 - 권한있어야함
    - rm -i abc.txt : 정말 삭제할지 확인 메시지
    - -f : 삭제시 확인하지 않고 바로 삭제
    - -r : 해당디렉터리 삭제
    - -rf : 해당디렉터리 확인하지 않고 강제 삭제
- cp
    - cp abc.txt cba.txt
        - abc.txt를 cba.txt라는 이름으로 바꿔서 복사
    - -r : 디렉터리 복사
- touch
    - 크기가 0인 새파일 생성
    - 이미 파일존재한다면  최종수정시간 현재시간으로 변경
    - 시간 없는 파일에 시간 추가 가능
- mv
    - 파일 디렉터리 이름 변경하거나 다른디렉터리로 옮길 때
- mkdir
    - 새로운 디렉터리 생성
    - mkdir abc
        - 현재 디렉터리 아래에 /abc 디렉터리 생성
    - mkdir -p /def/fgh
        - 부모디렉터리 없으면 자동생성, parents의 약자
- cat
    - 파일 내용 화면에 보여줌
    - cat test.txt test2.txt test3.txt > alltest.txt
        - 한파일로 합쳐서 파일 보여줌
- head, tail
    - 파일의 앞 10행, 마지막 10행 출력
    - head -3 : 앞 3행 출력
    - tail -5 : 마지막 5행 출력
- more
    - 텍스트 파일 페이지 단위로 화면 출력
    - space bar 누르면 다음 페이지 이동, B누르면 앞페이지, Q누르면 종료
    - more +10 test.txt
        - 10행부터 보여줌
    - more alltest.txt = cat alltest.txt | more
- less
    - more과 비슷하지만 기능확장
    - more 키도 사용가능하며, pageup&pagedown 사용 가능
- file
    - 해당 파일이 어떤 종류의 파일인지 표시
    - dvd장치 - block special
    - 텍스트 파일 - 아스키파일

## 사용자관리와 파일 속성

### 사용자와 그룹

- 리눅스는 다중 사용자 시스템
- vi /etc/passwd
    - 사용자이름:암호:사용자ID:사용자소속그룹ID:전체이름:홈디렉터리:기본셀
    - 암호는 x로 표시
        - /etc/shadow 파일에 비밀번호 지정되어 있음
- vi /etc/group
    - 사용자이름:암호:그룹id:그룹에속한사용자이름
        - 그룹에 속한 사용자이름은 참조로 사용된다, 아무것도 써있지 않다고 해서 그룹에 소속된 사용자가 반드시 없다는 뜻 아님

### 사용자와 그룹 관련 명령어

- useradd
    - 새로운 사용자 추가
    - /etc/passwd, /etc/group, /etc/shadow에 새로운 행 추가
    - -u : 사용자 id 지정
    - -g : 그룹 지정
    - -d : 홈디렉터리 지정
    - -s : 기본 셸 지정
- passwd
    - 사용자 비밀번호 지정하거나 변경
- usermod
    - 사용자 속성 변경
    - -g : 그룹변경
- userdel
    - 사용자 삭제
    - -r : 홈디렉터리까지 삭제
- chage
    - 사용자 암호 주기적으로 변경
    - -l : 설정된 사항 확인
    - -m : 사용해야하는 최소 일자
    - -M : 사용할 수 있는 최대 일자
    - -E : 만료날자
    - -W : 경고기간
- groups
    - 사용자가 소속된 그룹 보여줌
- groupadd
    - 새로운 그룹 생성
    - -g : 그룹id 지정
- groupmod
    - 그룹 속성 변경(바람직하지 않음)
    - -n : 이름변경
- groupdel
    - 그룹 삭제
- gpasswd
    - 그룹 암호 설정하거나 그룹 관리를 수행
    - -A :  관리자 지정
    - -a : 사용자로 추가
    - -d : 사용자 제거
    - !! : 암호지정되어있지 않다는 표시임
    

### 파일과 디렉터리의 소유권과 허가권

- 파일유형-파일허가권-링크수-파일소유자이름-파일소유그룹이름-파일크기-마지막변경날짜/시간-파일이름
- 파일유형
    - 디렉터리인 경우 'd'
    - 일반적인 파일인경우 '-'
    - b : 블록디바이스, c : 문자디바이스, l : 링크
- 파일허가권
    - 첫번째 : 소유자
    - 두번째 : 그룹
    - 세번째 : 그외 사용자
    - r : 4, w : 2, x : 1
        - 파일허가권 변경하는 명령어 chmod
            - chmod 777 sample.txt - 모든 사용자 읽고, 쓰고, 실행 가능
            - 상대모드로 사용가능
                - chmod u+x 파일이름 : 소유자에게 실행권한 허가하라는 의미
                - u-wx : 사용자에게 쓰기와 실행권한 제거
- 파일 소유권
    - chown/chgrp 명령 사용
    - chown 새로운사용자이름(.새로운그룹이름) 파일이름
    - 사용자변경/그룹변경
- 특수한형태의 파일권한
    - rwx외에도 특수한용도의 setuid, setgid, sticky bit가 있다.
    - 이제까지 주로 8진수 3자리로만 표현했으나, 실제로 4자리로 표현할 수 있다.
    - setuid bit
        - 8진수 네자리중 첫번째 값을 4로 표현하는 것
        - x자리에 s를 준다
        - 일반 사용자도 실행할 수 있다.
        - chmod u+s 파일명  명령 사용
        - 보안상 바람직하지 않음
            - 프로그램 실행시 사용자 권한이 아닌 소유자 권한으로 실행한다.
    - setgit bit
        - 8진수 네자리중 첫번째값을 2로 표현하는 것
        - 사용자가 아닌 그룹에 대해서 적용됨
        - setuid와 작동개념은 비슷함
    - sticky bit
        - 8진수 네자리 중 첫번째값을 1로 표현하는 것
        - 여러사람이 공유할 디렉터리에 주로 설정
        - 디렉터리 안에서 모든 사용자가 파일/디렉터리를 생성해 사용할 수 있지만, 다른 사용자의 파일을 삭제하지 못한다.
        - chmod o+t 파일명 등의 명령어 사용
